/* 
   Localizable.strings
   Proxly

   Created for localization support.
*/

// MARK: - Defaults
"defaults.new_rule_name" = "Nouvelle règle";

// MARK: - Tab Navigation
"tab.rules" = "Règles";
"tab.settings" = "Paramètres";
"tab.about" = "À propos";

// MARK: - General UI
"window.title.settings" = "Paramètres de Proxly";
"button.add_rule" = "Ajouter une règle";
"button.save" = "Enregistrer";
"button.cancel" = "Annuler";
"button.delete" = "Supprimer";
"button.ok" = "OK";
"button.open_system_preferences" = "Ouvrir les Préférences Système";

// MARK: - Settings View
"settings.title" = "Paramètres";
"settings.section.general" = "Général";
"settings.section.default_behavior" = "Comportement par défaut";
"settings.section.logging" = "Journalisation";

"settings.enable_rules.title" = "Activer les règles";
"settings.enable_rules.subtitle.enabled" = "Les règles sont actives";
"settings.enable_rules.subtitle.disabled" = "⚠️ Toutes les règles seront ignorées !";

"settings.launch_at_login.title" = "Lancer à l'ouverture de session";
"settings.launch_at_login.subtitle" = "Démarrer Proxly automatiquement lorsque vous vous connectez à votre Mac";

"settings.when_no_rule_matches" = "Lorsqu'aucune règle ne correspond :";
"settings.default_behavior.show_selection" = "Afficher la sélection du navigateur";
"settings.default_behavior.open_fallback" = "Ouvrir le navigateur de secours";

"settings.fallback_browser.title" = "Navigateur de secours";
"settings.fallback_browser.subtitle" = "Utilisé lorsqu'aucune règle ne correspond et que 'Ouvrir le navigateur de secours' est sélectionné";

"settings.notify_fallback.title" = "Afficher une notification lorsque le navigateur de secours est utilisé";
"settings.notify_fallback.subtitle" = "Recevoir une notification lorsqu'une URL est ouverte avec le navigateur de secours";

"settings.tooltips.title" = "Afficher les infobulles";
"settings.tooltips.subtitle" = "Afficher des conseils utiles lors du survol des éléments de l'interface";
"settings.tooltips.enable_rules" = "Activez ou désactivez toutes les règles de routage des navigateurs. Lorsqu'elle est désactivée, toutes les règles sont ignorées et le comportement par défaut est utilisé.";
"settings.tooltips.launch_at_login" = "Lorsqu'elle est activée, Proxly démarrera automatiquement lorsque vous vous connectez à votre Mac, garantissant que vos règles sont toujours actives.";
"settings.tooltips.default_behavior" = "Choisissez ce qui se passe lorsqu'aucune règle ne correspond à une URL : afficher le dialogue de sélection de navigateur ou ouvrir automatiquement avec le navigateur de secours.";
"settings.tooltips.fallback_browser" = "Sélectionnez le navigateur à utiliser comme secours lorsqu'aucune règle ne correspond et que l'option de secours est sélectionnée.";
"settings.tooltips.notify_fallback" = "Lorsqu'elle est activée, vous recevrez une notification chaque fois qu'une URL est ouverte avec le navigateur de secours.";
"settings.tooltips.enable_logging" = "Activez la journalisation pour aider à diagnostiquer les problèmes. Proxly enregistrera les URL ouvertes et les messages de diagnostic. Aucune donnée personnelle n'est collectée.";
"settings.tooltips.show_tooltips" = "Activez ce paramètre pour afficher ou masquer les infobulles utiles lors du survol des éléments de l'interface.";

"settings.logging.enable" = "Activer la journalisation";
"settings.logging.subtitle" = "Lorsqu'il est activé, Proxly enregistre les URL ouvertes et les messages de diagnostic. Aucune donnée n'est collectée.";

// MARK: - Notifications
"notification.permission.title" = "Autorisation de notification requise";
"notification.permission.message" = "Proxly a besoin de l'autorisation pour envoyer des notifications. Veuillez activer les notifications dans les Préférences Système.";
"notification.denied.title" = "Notifications refusées";
"notification.denied.message" = "Vous avez précédemment refusé les autorisations de notification. Veuillez activer les notifications dans les Préférences Système si vous souhaitez recevoir des alertes.";
"notification.fallback.title" = "Navigateur de secours utilisé";
"notification.fallback.body" = "URL ouverte dans le navigateur de secours : %@";

// MARK: - Rules View
"rules.title" = "Règles";
"rules.status.enabled" = "Activé";
"rules.status.disabled" = "Désactivé";
"rules.empty.title" = "Aucune règle pour le moment";
"rules.empty.subtitle" = "Créez votre première règle pour commencer à acheminer intelligemment les URL";
"rules.empty.description" = "Les règles vous permettent d'ouvrir automatiquement différents sites Web dans des navigateurs spécifiques en fonction des domaines, des modes de concentration ou de l'heure de la journée.";
"rules.select.title" = "Sélectionner une règle";
"rules.select.subtitle" = "Choisissez une règle dans la liste pour afficher et modifier ses détails";
"rules.priority.title" = "Priorité";

// MARK: - Rule Edit View
"rule.edit.title.new" = "Ajouter une règle";
"rule.edit.title.edit" = "Modifier la règle";
"rule.edit.name.placeholder" = "Saisir le nom de la règle";
"rule.edit.name.empty" = "Le nom de la règle ne peut pas être vide";
"rule.edit.name.valid" = "Le nom de la règle est valide";
"rule.edit.saved.title" = "Règle enregistrée";
"rule.edit.section.name" = "Nom";
"rule.edit.section.type" = "Type de règle";
"rule.edit.section.condition" = "Condition";
"rule.edit.section.browser" = "Navigateur cible";
"rule.edit.section.priority" = "Priorité";

"rule.condition.placeholder" = "par exemple, apple.com ou Travail";
"rule.validation.empty" = "La condition ne peut pas être vide.";
"rule.validation.duplicate" = "Une règle avec ce type et cette condition existe déjà.";
"rule.validation.valid" = "La condition est valide";

"rule.priority.title" = "Niveau de priorité";
"rule.priority.subtitle" = "Les règles de priorité supérieure sont évaluées en premier";

"rule.delete.title" = "Supprimer la règle";
"rule.delete.message" = "Êtes-vous sûr de vouloir supprimer cette règle ? Cette action est irréversible.";

// MARK: - Rule Types
"rule_type.domain" = "Domaine";
"rule_type.focus_mode" = "Mode de concentration";
"rule_type.time" = "Temps";

// MARK: - Time-Based Rules
"time_rule.time.start" = "Heure de début";
"time_rule.time.end" = "Heure de fin";
"time_rule.time.section_title" = "Plage horaire";
"time_rule.time.overnight_warning" = "Cette règle sera active pendant la nuit (traverse minuit)";
"time_rule.time.active_preview" = "Active de %@ à %@";

"time_rule.days.section_title" = "Jours de la semaine";
"time_rule.days.weekdays" = "Jours ouvrables";
"time_rule.days.weekends" = "Week-ends";
"time_rule.days.all_days" = "Tous les jours";
"time_rule.days.clear" = "Effacer";

"time_rule.days.sunday" = "Dimanche";
"time_rule.days.monday" = "Lundi";
"time_rule.days.tuesday" = "Mardi";
"time_rule.days.wednesday" = "Mercredi";
"time_rule.days.thursday" = "Jeudi";
"time_rule.days.friday" = "Vendredi";
"time_rule.days.saturday" = "Samedi";

"time_rule.days.sun" = "Dim";
"time_rule.days.mon" = "Lun";
"time_rule.days.tue" = "Mar";
"time_rule.days.wed" = "Mer";
"time_rule.days.thu" = "Jeu";
"time_rule.days.fri" = "Ven";
"time_rule.days.sat" = "Sam";

"time_rule.days.active_on" = "Active le : %@";

"time_rule.preview.title" = "Aperçu de la règle";
"time_rule.preview.summary" = "Active le %@ de %@ à %@";
"time_rule.preview.every_day" = "Chaque jour";

"time_rule.validation.invalid_time_range" = "L'heure de début et de fin ne peuvent pas être identiques";
"time_rule.validation.no_days_selected" = "Veuillez sélectionner au moins un jour";
"time_rule.validation.duplicate_range" = "Cette plage horaire existe déjà pour les jours sélectionnés";

// MARK: - Browser Selection
"browser_selection.title" = "Choisir un navigateur";
"browser_selection.subtitle" = "Sélectionnez le navigateur qui doit ouvrir ce lien";
"browser_selection.url_label" = "Ouverture :";
"browser_selection.remember" = "Mémoriser ce choix";
"browser_selection.action" = "Ouvrir";

// MARK: - About View
"about.title" = "À propos";
"about.app_subtitle" = "Sélecteur de navigateur intelligent";
"about.version" = "Version";
"about.build" = "Build";

"about.section.what_is" = "Qu'est-ce que Proxly ?";
"about.description.main" = "Proxly est un sélecteur de navigateur intelligent qui achemine automatiquement les liens Web vers le bon navigateur en fonction de règles personnalisables.";
"about.description.detail" = "Ne vous souciez plus jamais d'ouvrir des liens professionnels dans votre navigateur personnel ou vice versa. Configurez des règles basées sur les domaines, les modes de concentration ou l'heure de la journée, et laissez Proxly s'occuper du reste.";

"about.section.features" = "Fonctionnalités clés";
"about.feature.domain_rules.title" = "Règles basées sur le domaine";
"about.feature.domain_rules.description" = "Acheminer des sites Web spécifiques vers des navigateurs désignés";
"about.feature.focus_mode.title" = "Intégration du mode de concentration";
"about.feature.focus_mode.description" = "Différents navigateurs pour le travail et le temps personnel";
"about.feature.time_based.title" = "Routage basé sur le temps";
"about.feature.time_based.description" = "Sélection automatique du navigateur en fonction de l'heure de la journée";
"about.feature.priority.title" = "Système de priorité";
"about.feature.priority.description" = "Affiner la priorité des règles avec des niveaux de priorité";

"about.feature.menu_bar.title" = "Intégration de la barre de menus";
"about.feature.menu_bar.description" = "Accès rapide aux règles et paramètres depuis la barre de menus";

"about.section.developer" = "Développeur";
"about.developer.name" = "Paweł Mazurkiewicz";
"about.developer.role" = "Développeur macOS";
"about.developer.description" = "Créer de belles applications fonctionnelles pour Mac";

"about.section.links" = "Liens et assistance";
"about.link.website" = "Site Web";
"about.link.support" = "Assistance";
"about.link.support_description" = "Besoin d'aide ? Faites-le moi savoir !";
"about.link.feature_request" = "Demander une fonctionnalité";
"about.link.feature_request_description" = "Vous avez une idée pour une nouvelle fonctionnalité ? Partagez-la !";
"about.link.rate" = "Évaluer Proxly sur l'App Store";
"about.link.rate_description" = "Si vous aimez utiliser Proxly, veuillez envisager de laisser une évaluation sur l'App Store !";
"about.link.github" = "Code source";

// MARK: - Menu Bar
"menu.toggle_rules" = "Activer/Désactiver les règles";
"menu.open_settings" = "Ouvrir les paramètres...";
"menu.quit" = "Quitter Proxly";

// MARK: - Errors
"error.app_not_found" = "Application avec l'identifiant de bundle '%@' introuvable.";
"error.open_failed" = "Échec de l'ouverture de l'URL : %@";

/* Rule List */
"rule_list_title" = "Règles";
"rule_list_subtitle" = "Gérez vos règles de routage de navigateur";
"rule_list_browser" = "Navigateur";
"rule_list_priority" = "Priorité";

// MARK: - Focus Mode
"focus.app_filter.title" = "Filtre de focus de l'application";
"focus.app_filter.description" = "Configurer le comportement de l'application pour différents modes de focus";
"focus.display_representation.title" = "Focus: %@";
"focus.display_representation.subtitle" = "Comportement personnalisé de l'application pour ce focus";
"focus.unnamed" = "Sans nom";

"focus.status.not_determined" = "Non déterminé";
"focus.status.restricted" = "Restreint";
"focus.status.denied" = "Refusé";
"focus.status.authorized" = "Autorisé";
"focus.status.unknown" = "Inconnu";

"focus.info.status.active" = "Actif";
"focus.info.status.inactive" = "Inactif";
"focus.info.authorization" = "Autorisation";
"focus.info.name" = "Nom du focus";
"focus.info.name.not_available" = "Non disponible (nécessite une configuration utilisateur)";

// MARK: - Focus Suggestions
"focus.suggestion.work" = "Travail";
"focus.suggestion.personal" = "Personnel";
"focus.suggestion.sleep" = "Sommeil";
"focus.suggestion.do_not_disturb" = "Ne pas déranger";

// MARK: - Accessibility
"accessibility.section.label" = "Section";

// Rule Edit Accessibility
"accessibility.rule_edit.name.label" = "Nom de la règle";
"accessibility.rule_edit.name.hint" = "Entrez un nom descriptif pour cette règle";

"accessibility.rule_edit.rule_type.section_label" = "Sélection du type de règle";
"accessibility.rule_edit.rule_type.domain.label" = "Règle basée sur le domaine";
"accessibility.rule_edit.rule_type.domain.hint" = "Créer une règle qui correspond aux domaines de sites web";
"accessibility.rule_edit.rule_type.focus_mode.label" = "Règle de mode focus";
"accessibility.rule_edit.rule_type.focus_mode.hint" = "Créer une règle qui s'active pendant des modes focus spécifiques";
"accessibility.rule_edit.rule_type.time.label" = "Règle basée sur le temps";
"accessibility.rule_edit.rule_type.time.hint" = "Créer une règle qui s'active pendant des heures et jours spécifiques";

"accessibility.rule_edit.condition.label" = "Condition de la règle";
"accessibility.rule_edit.condition.hint" = "Entrez la condition qui déclenchera cette règle";
"accessibility.rule_edit.condition.section_label" = "Condition de la règle";

"accessibility.rule_edit.browser.section_label" = "Sélection du navigateur cible";
"accessibility.rule_edit.browser.selected_hint" = "Appuyez pour sélectionner un navigateur différent";
"accessibility.rule_edit.browser.unselected_hint" = "Appuyez pour sélectionner ce navigateur";
"accessibility.rule_edit.browser.selected_label" = "Navigateur %@, actuellement sélectionné";
"accessibility.rule_edit.browser.unselected_label" = "Navigateur %@, non sélectionné";

"accessibility.rule_edit.browser_row.selected_label" = "Navigateur sélectionné";
"accessibility.rule_edit.browser_row.unselected_label" = "Navigateur disponible";
"accessibility.rule_edit.browser_row.selected_hint" = "Ce navigateur est actuellement sélectionné pour cette règle";
"accessibility.rule_edit.browser_row.unselected_hint" = "Appuyez pour sélectionner ce navigateur pour cette règle";

"accessibility.rule_edit.priority.label" = "Priorité de la règle";
"accessibility.rule_edit.priority.hint" = "Ajustez le niveau de priorité pour cette règle. Les règles de priorité supérieure ont la précédence";
"accessibility.rule_edit.priority.section_label" = "Paramètre de priorité";
"accessibility.rule_edit.priority.value_label" = "Niveau de priorité %d";

"accessibility.rule_edit.button.save.hint" = "Sauvegarder la configuration actuelle de la règle";
"accessibility.rule_edit.button.save.hint_disabled" = "Complétez tous les champs requis pour sauvegarder la règle";
"accessibility.rule_edit.button.cancel.hint" = "Annuler l'édition et abandonner les modifications";
"accessibility.rule_edit.button.delete.hint" = "Supprimer cette règle définitivement";
"accessibility.rule_edit.button.delete.label" = "Supprimer la règle";

"accessibility.rule_edit.validation.error_label" = "Erreur de validation";
"accessibility.rule_edit.validation.success_label" = "Validation réussie";

"accessibility.rule_edit.success.label" = "Règle sauvegardée avec succès";
"accessibility.rule_edit.success.hint" = "La règle a été sauvegardée et est maintenant active";

// General Accessibility
"accessibility.general.section_header" = "En-tête de section";
"accessibility.general.validation_message" = "Message de validation";
"accessibility.general.success_indicator" = "Indicateur de succès";

// Browser Selection Accessibility
"accessibility.browser_selection.row_label" = "Option de navigateur";
"accessibility.browser_selection.selected_state" = "Sélectionné";
"accessibility.browser_selection.unselected_state" = "Non sélectionné";

// Time-Based Rule Accessibility
"accessibility.time_based_rule.time_range.section_label" = "Paramètres de plage horaire";
"accessibility.time_based_rule.time_range.start_time_label" = "Heure de début";
"accessibility.time_based_rule.time_range.end_time_label" = "Heure de fin";
"accessibility.time_based_rule.time_range.start_time_hint" = "Définissez l'heure à laquelle cette règle devient active";
"accessibility.time_based_rule.time_range.end_time_hint" = "Définissez l'heure à laquelle cette règle devient inactive";

"accessibility.time_based_rule.day_selection.section_label" = "Sélection des jours";
"accessibility.time_based_rule.day_selection.day_selected_hint" = "Ce jour est inclus dans la règle";
"accessibility.time_based_rule.day_selection.day_unselected_hint" = "Appuyez pour inclure ce jour dans la règle";

"accessibility.time_based_rule.preview.label" = "Aperçu de la règle";
"accessibility.time_based_rule.preview.hint" = "Résumé de quand cette règle sera active";

"accessibility.time_based_rule.time_range.overnight_warning_label" = "Avertissement de plage nocturne : cette règle sera active après minuit";
"accessibility.time_based_rule.time_range.preview_label" = "Aperçu de la plage horaire active";
"accessibility.time_based_rule.day_selection.day_button_label" = "Jour : %@, Statut : %@";
"accessibility.time_based_rule.day_selection.clear_button_label" = "Effacer la sélection";
"accessibility.time_based_rule.day_selection.clear_button_hint" = "Appuyez pour désélectionner tous les jours de la semaine";
"accessibility.time_based_rule.day_selection.preset_button_label" = "Préréglage : %@, Statut : %@";
"accessibility.time_based_rule.day_selection.preset_button_hint" = "Appuyez pour appliquer un préréglage de jour comme les jours de semaine ou les week-ends";
"accessibility.time_based_rule.day_selection.selected_days_preview_label" = "Aperçu des jours sélectionnés";

// MARK: - Accessibility Strings for Settings
"accessibility.settings.toolbar.title.label" = "Paramètres de Proxly";
"accessibility.settings.toolbar.title.hint" = "Page principale de paramètres pour la configuration de l'application Proxly";

// Settings - General Section
"accessibility.settings.general.section_label" = "Section des Paramètres Généraux";
"accessibility.settings.general.enable_rules.label" = "Commutateur d'activation des règles";
"accessibility.settings.general.enable_rules.hint" = "Lorsqu'activé, toutes les règles seront actives. Lorsque désactivé, toutes les règles seront ignorées";
"accessibility.settings.general.enable_rules.value.enabled" = "Les règles sont activées";
"accessibility.settings.general.enable_rules.value.disabled" = "Les règles sont désactivées";
"accessibility.settings.general.launch_at_login.label" = "Commutateur de lancement à la connexion";
"accessibility.settings.general.launch_at_login.hint" = "Lorsqu'activé, Proxly démarrera automatiquement lors de la connexion à votre Mac";
"accessibility.settings.general.launch_at_login.value.enabled" = "Le lancement à la connexion est activé";
"accessibility.settings.general.launch_at_login.value.disabled" = "Le lancement à la connexion est désactivé";

// Settings - Default Behavior Section
"accessibility.settings.default_behavior.section_label" = "Section des Paramètres de Comportement par Défaut";
"accessibility.settings.default_behavior.picker.label" = "Sélecteur de comportement par défaut";
"accessibility.settings.default_behavior.picker.hint" = "Choisissez ce qui se passe quand aucune règle ne correspond à une URL. Soit afficher la sélection de navigateur ou ouvrir le navigateur de secours";
"accessibility.settings.default_behavior.picker.value" = "Actuellement défini sur %@";
"accessibility.settings.fallback_browser.picker.label" = "Sélecteur de navigateur de secours";
"accessibility.settings.fallback_browser.picker.hint" = "Sélectionnez quel navigateur utiliser comme secours quand aucune règle ne correspond et l'option de secours est sélectionnée";
"accessibility.settings.fallback_browser.picker.value" = "Actuellement défini sur %@";
"accessibility.settings.refresh_browsers.label" = "Bouton d'actualisation des navigateurs";
"accessibility.settings.refresh_browsers.hint" = "Appuyez pour actualiser la liste des navigateurs disponibles";
"accessibility.settings.notify_fallback.label" = "Commutateur de notification de secours";
"accessibility.settings.notify_fallback.hint" = "Lorsqu'activé, vous recevrez une notification quand une URL est ouverte avec le navigateur de secours";
"accessibility.settings.notify_fallback.value.enabled" = "Les notifications de secours sont activées";
"accessibility.settings.notify_fallback.value.disabled" = "Les notifications de secours sont désactivées";

// Settings - Logging Section
"accessibility.settings.logging.section_label" = "Section des Paramètres de Journalisation";
"accessibility.settings.logging.enable.label" = "Commutateur d'activation de la journalisation";
"accessibility.settings.logging.enable.hint" = "Lorsqu'activé, Proxly enregistrera les URLs ouvertes et les messages de diagnostic pour le dépannage";
"accessibility.settings.logging.enable.value.enabled" = "La journalisation est activée";
"accessibility.settings.logging.enable.value.disabled" = "La journalisation est désactivée";

// MARK: - Missing Strings
"Navigation Tab Bar" = "Barre d'Onglets de Navigation";
"Unknown Browser" = "Navigateur Inconnu";
"%@ %lld" = "%@ %lld";
"" = "";

// MARK: - Direct Settings Accessibility Keys (matching LocalizationHelper structure)
"accessibility.settings.enable_rules.label" = "Commutateur d'activation des règles";
"accessibility.settings.enable_rules.hint" = "Lorsqu'activé, toutes les règles seront actives. Lorsque désactivé, toutes les règles seront ignorées";
"accessibility.settings.enable_rules.value.enabled" = "Les règles sont activées";
"accessibility.settings.enable_rules.value.disabled" = "Les règles sont désactivées";
"accessibility.settings.launch_at_login.label" = "Commutateur de lancement à la connexion";
"accessibility.settings.launch_at_login.hint" = "Lorsqu'activé, Proxly démarrera automatiquement lors de la connexion à votre Mac";
"accessibility.settings.launch_at_login.value.enabled" = "Le lancement à la connexion est activé";
"accessibility.settings.launch_at_login.value.disabled" = "Le lancement à la connexion est désactivé";

// MARK: - About Accessibility
"accessibility.about.toolbar.title.label" = "À propos de Proxly";
"accessibility.about.toolbar.title.hint" = "Informations sur l'application Proxly, ses fonctionnalités et son développeur";

"accessibility.about.navigation.scroll_view.label" = "Informations sur l'application";
"accessibility.about.navigation.scroll_view.hint" = "Faites défiler pour voir les informations sur l'application, les fonctionnalités et les liens";

"accessibility.about.app_info.section_label" = "Informations sur l'application";
"accessibility.about.app_info.app_icon.label" = "Icône de l'application Proxly";
"accessibility.about.app_info.app_icon.hint" = "Icône officielle de l'application Proxly";
"accessibility.about.app_info.app_name.label" = "Proxly - Routeur de navigateur intelligent";
"accessibility.about.app_info.app_subtitle.label" = "Routage intelligent de navigateur pour macOS";
"accessibility.about.app_info.version_badge.label" = "%@ %@";
"accessibility.about.app_info.version_badge.hint" = "Informations sur la version de l'application et la compilation";

"accessibility.about.description.section_label" = "Description de l'application";
"accessibility.about.description.section_hint" = "Découvrez ce que fait Proxly et comment cela aide à la gestion du navigateur";
"accessibility.about.description.main_text.label" = "Description principale de l'application";
"accessibility.about.description.detail_text.label" = "Description détaillée de l'application";

"accessibility.about.features.section_label" = "Fonctionnalités de l'application";
"accessibility.about.features.section_hint" = "Découvrez toutes les fonctionnalités puissantes que Proxly offre";
"accessibility.about.features.feature_row.label" = "Fonctionnalité : %@";
"accessibility.about.features.feature_row.hint" = "Description : %@";
"accessibility.about.features.feature_list.label" = "Liste des fonctionnalités de Proxly";

"accessibility.about.developer.section_label" = "Informations sur le développeur";
"accessibility.about.developer.section_hint" = "Découvrez la personne qui a créé Proxly";
"accessibility.about.developer.photo.label" = "Photo du développeur";
"accessibility.about.developer.photo.hint" = "Photo de Paweł Mazurkiewicz, le développeur de Proxly";
"accessibility.about.developer.name.label" = "Nom du développeur : Paweł Mazurkiewicz";
"accessibility.about.developer.role.label" = "Rôle : Développeur macOS";
"accessibility.about.developer.description.label" = "Bio : Créer de belles applications fonctionnelles pour Mac";

"accessibility.about.links.section_label" = "Liens et assistance";
"accessibility.about.links.section_hint" = "Accéder au support, demander des fonctionnalités et évaluer l'application";
"accessibility.about.links.link_button.label" = "Bouton %@";
"accessibility.about.links.link_button.hint" = "%@ - appuyez pour ouvrir";
"accessibility.about.links.support_button.label" = "Contacter le support";
"accessibility.about.links.support_button.hint" = "Envoyez un e-mail pour obtenir de l'aide avec Proxly ou signaler des bugs";
"accessibility.about.links.feature_request_button.label" = "Demander une fonctionnalité";
"accessibility.about.links.feature_request_button.hint" = "Envoyez un e-mail pour suggérer de nouvelles fonctionnalités pour Proxly";
"accessibility.about.links.rate_button.label" = "Évaluer sur l'App Store";
"accessibility.about.links.rate_button.hint" = "Ouvrir l'App Store pour évaluer et commenter Proxly";

// MARK: - Additional Settings Accessibility
"accessibility.settings.enable_rules.label" = "Commutateur d'activation des règles";
"accessibility.settings.enable_rules.hint" = "Lorsqu'activé, toutes les règles seront actives. Lorsque désactivé, toutes les règles seront ignorées";
"accessibility.settings.enable_rules.value.enabled" = "Les règles sont activées";
"accessibility.settings.enable_rules.value.disabled" = "Les règles sont désactivées";
"accessibility.settings.launch_at_login.label" = "Commutateur de lancement à la connexion";
"accessibility.settings.launch_at_login.hint" = "Lorsqu'activé, Proxly démarrera automatiquement lors de la connexion à votre Mac";
"accessibility.settings.launch_at_login.value.enabled" = "Le lancement à la connexion est activé";
"accessibility.settings.launch_at_login.value.disabled" = "Le lancement à la connexion est désactivé";

// MARK: - ContentView Accessibility
"accessibility.content_view.container_label" = "Fenêtre Principale de Proxly";
"accessibility.content_view.container_hint" = "La fenêtre principale de l'application contenant des onglets de navigation pour Règles, Paramètres et À propos";

"accessibility.content_view.tab_view.container_label" = "Navigation Principale";
"accessibility.content_view.tab_view.container_hint" = "Navigation par onglets pour basculer entre différentes sections de Proxly";

"accessibility.content_view.tab.rules.label" = "Onglet Règles";
"accessibility.content_view.tab.rules.hint" = "Appuyez pour voir et gérer les règles de routage de navigateur";
"accessibility.content_view.tab.rules.selected" = "Onglet règles sélectionné";
"accessibility.content_view.tab.rules.unselected" = "Onglet règles non sélectionné";

"accessibility.content_view.tab.settings.label" = "Onglet Paramètres";
"accessibility.content_view.tab.settings.hint" = "Appuyez pour voir et modifier les paramètres de l'application";
"accessibility.content_view.tab.settings.selected" = "Onglet paramètres sélectionné";
"accessibility.content_view.tab.settings.unselected" = "Onglet paramètres non sélectionné";

"accessibility.content_view.tab.about.label" = "Onglet À propos";
"accessibility.content_view.tab.about.hint" = "Appuyez pour voir les informations sur Proxly et les détails du développeur";
"accessibility.content_view.tab.about.selected" = "Onglet à propos sélectionné";
"accessibility.content_view.tab.about.unselected" = "Onglet à propos non sélectionné";

// MARK: - Rule List Accessibility
"accessibility.rule_list.navigation.container_label" = "Navigation des Règles";
"accessibility.rule_list.navigation.container_hint" = "Navigation de vue divisée contenant la liste des règles et l'interface d'édition";
"accessibility.rule_list.navigation.sidebar_label" = "Barre Latérale des Règles";
"accessibility.rule_list.navigation.sidebar_hint" = "Liste de toutes vos règles de routage de navigateur";

"accessibility.rule_list.toolbar.title_label" = "Titre de l'Écran des Règles";
"accessibility.rule_list.toolbar.title_hint" = "Titre principal pour l'écran de gestion des règles";

"accessibility.rule_list.button.add_rule_label" = "Ajouter une Règle";
"accessibility.rule_list.button.add_rule_hint" = "Appuyez pour créer une nouvelle règle de routage de navigateur";

"accessibility.rule_list.toggle.rules_enabled_label" = "Commutateur de Règles Activées";
"accessibility.rule_list.toggle.rules_enabled_hint" = "Basculer pour activer ou désactiver toutes les règles. Lorsque désactivé, toutes les règles seront ignorées";
"accessibility.rule_list.toggle.rules_enabled_value_on" = "Les règles sont activées";
"accessibility.rule_list.toggle.rules_enabled_value_off" = "Les règles sont désactivées";

"accessibility.rule_list.empty_state.container_label" = "Message Aucune Règle";
"accessibility.rule_list.empty_state.container_hint" = "Affichage d'information lorsqu'aucune règle n'a encore été créée";
"accessibility.rule_list.empty_state.description_label" = "Description Aucune Règle";
"accessibility.rule_list.empty_state.description_hint" = "Explication de ce que font les règles et pourquoi elles sont utiles";
"accessibility.rule_list.empty_state.create_button_label" = "Créer la Première Règle";
"accessibility.rule_list.empty_state.create_button_hint" = "Appuyez pour créer votre première règle de routage de navigateur";

"accessibility.rule_list.list.scroll_view_label" = "Liste des Règles";
"accessibility.rule_list.list.scroll_view_hint" = "Liste déroulante contenant %d règles";

"accessibility.rule_list.rule_card.button_label" = "Règle %@";
"accessibility.rule_list.rule_card.button_hint" = "Appuyez pour voir et éditer cette règle";
"accessibility.rule_list.rule_card.selected_value" = "Sélectionné";
"accessibility.rule_list.rule_card.unselected_value" = "Non sélectionné";

"accessibility.rule_list.rule_card.type_label" = "Type de règle : %@";
"accessibility.rule_list.rule_card.type_hint" = "Le type de condition que cette règle correspond";

"accessibility.rule_list.rule_card.name_label" = "Nom de la règle : %@";

"accessibility.rule_list.rule_card.condition_label" = "Condition : %@";

"accessibility.rule_list.rule_card.browser_label" = "Navigateur cible : %@";
"accessibility.rule_list.rule_card.browser_hint" = "Le navigateur qui ouvrira les liens correspondant à cette règle";

"accessibility.rule_list.rule_card.priority_label" = "Priorité : %d";
"accessibility.rule_list.rule_card.priority_hint" = "Niveau de priorité de la règle - les nombres plus élevés ont la précédence";

"accessibility.rule_list.detail.edit_view_label" = "Éditer la Règle %@";
"accessibility.rule_list.detail.edit_view_hint" = "Interface d'édition de règle pour modifier les paramètres de règle";
"accessibility.rule_list.detail.placeholder_label" = "Sélectionner une Règle";
"accessibility.rule_list.detail.placeholder_hint" = "Choisissez une règle de la liste pour voir et éditer ses détails";

// MARK: - MenuBarManager Accessibility
"accessibility.menu_bar_manager.status_item.button_label" = "Barre de Menu Proxly";
"accessibility.menu_bar_manager.status_item.button_hint_enabled" = "Proxly est actif et les règles sont activées. Clic gauche pour ouvrir les paramètres, clic droit pour les actions rapides";
"accessibility.menu_bar_manager.status_item.button_hint_disabled" = "Proxly fonctionne mais les règles sont désactivées. Clic gauche pour ouvrir les paramètres, clic droit pour les actions rapides";
"accessibility.menu_bar_manager.status_item.role_description" = "Application de Barre de Menu";
"accessibility.menu_bar_manager.status_item.value_enabled" = "Règles activées";
"accessibility.menu_bar_manager.status_item.value_disabled" = "Règles désactivées";

"accessibility.menu_bar_manager.menu.container_label" = "Menu Proxly";
"accessibility.menu_bar_manager.menu.container_hint" = "Menu d'accès rapide pour les paramètres et actions de Proxly";

"accessibility.menu_bar_manager.menu.toggle_rules.label" = "Basculer les Règles";
"accessibility.menu_bar_manager.menu.toggle_rules.hint" = "Activer ou désactiver toutes les règles de routage de navigateur";

"accessibility.menu_bar_manager.menu.open_settings.label" = "Ouvrir les Paramètres";
"accessibility.menu_bar_manager.menu.open_settings.hint" = "Ouvrir la fenêtre principale des paramètres Proxly";

"accessibility.menu_bar_manager.menu.quit.label" = "Quitter Proxly";
"accessibility.menu_bar_manager.menu.quit.hint" = "Fermer l'application Proxly";

"accessibility.menu_bar_manager.actions.left_click" = "Ouvrir les Paramètres";
"accessibility.menu_bar_manager.actions.right_click" = "Afficher le Menu";
"accessibility.menu_bar_manager.actions.open_settings" = "Ouvrir la Fenêtre des Paramètres";
"accessibility.menu_bar_manager.actions.toggle_rules" = "Basculer l'Activation des Règles";
"accessibility.menu_bar_manager.actions.quit" = "Quitter l'Application";

// MARK: - SelectionPanel Accessibility
"accessibility.selection_panel.container.label" = "Panneau de sélection de navigateur";
"accessibility.selection_panel.container.hint" = "Choisissez avec quel navigateur ouvrir le lien. Utilisez les touches fléchées pour naviguer, Entrée pour sélectionner ou Échap pour annuler";
"accessibility.selection_panel.container.role_description" = "Dialogue modal pour la sélection de navigateur";

"accessibility.selection_panel.header.section_label" = "En-tête de sélection de navigateur";
"accessibility.selection_panel.header.title.label" = "Choisir un Navigateur";
"accessibility.selection_panel.header.title.hint" = "Titre principal pour le dialogue de sélection de navigateur";
"accessibility.selection_panel.header.subtitle.label" = "Sélectionnez quel navigateur doit ouvrir ce lien";
"accessibility.selection_panel.header.subtitle.hint" = "Instructions pour utiliser le dialogue de sélection de navigateur";
"accessibility.selection_panel.header.icon.label" = "Icône de sélection de navigateur";

"accessibility.selection_panel.browser_grid.container_label" = "Navigateurs disponibles";
"accessibility.selection_panel.browser_grid.container_hint" = "%d navigateurs disponibles. Utilisez les touches fléchées pour naviguer entre les options";
"accessibility.selection_panel.browser_grid.section_label" = "Grille d'options de navigateur";

"accessibility.selection_panel.browser_card.button_label" = "Sélectionner le navigateur %@";
"accessibility.selection_panel.browser_card.button_label_with_shortcut" = "Sélectionner le navigateur %@, raccourci %d";
"accessibility.selection_panel.browser_card.button_hint" = "Appuyez ou pressez Entrée pour ouvrir le lien avec ce navigateur";
"accessibility.selection_panel.browser_card.button_hint_with_shortcut" = "Appuyez, pressez Entrée ou pressez %d pour ouvrir le lien avec ce navigateur";
"accessibility.selection_panel.browser_card.icon_label" = "Icône du navigateur %@";
"accessibility.selection_panel.browser_card.name_label" = "Nom du navigateur %@";
"accessibility.selection_panel.browser_card.shortcut_badge_label" = "Raccourci %d";
"accessibility.selection_panel.browser_card.shortcut_badge_hint" = "Pressez cette touche numérique pour sélectionner rapidement ce navigateur";
"accessibility.selection_panel.browser_card.role_description" = "Bouton de sélection de navigateur";

"accessibility.selection_panel.url_section.container_label" = "Informations d'URL";
"accessibility.selection_panel.url_section.container_hint" = "Affiche l'adresse web qui sera ouverte";
"accessibility.selection_panel.url_section.section_label" = "Section URL";
"accessibility.selection_panel.url_section.icon_label" = "Icône de lien";
"accessibility.selection_panel.url_section.title_label" = "Ouverture :";
"accessibility.selection_panel.url_section.url_label" = "Adresse web : %@";
"accessibility.selection_panel.url_section.url_hint" = "Ceci est l'adresse web qui sera ouverte dans le navigateur sélectionné";

"accessibility.selection_panel.action_section.container_label" = "Actions et instructions";
"accessibility.selection_panel.action_section.container_hint" = "Contient les instructions d'utilisation et l'option d'annulation";
"accessibility.selection_panel.action_section.section_label" = "Section d'actions";
"accessibility.selection_panel.action_section.instructions_label" = "Pressez 1-9 ou cliquez pour sélectionner";
"accessibility.selection_panel.action_section.instructions_hint" = "Instructions pour sélectionner un navigateur en utilisant les raccourcis clavier ou la souris";
"accessibility.selection_panel.action_section.cancel_button.label" = "Annuler la sélection de navigateur";
"accessibility.selection_panel.action_section.cancel_button.hint" = "Fermer le panneau de sélection de navigateur sans ouvrir aucun navigateur";
"accessibility.selection_panel.action_section.cancel_button.role_description" = "Bouton d'annulation";

"accessibility.selection_panel.navigation.focus_moved_to_browser" = "Focus déplacé vers l'option de navigateur";
"accessibility.selection_panel.navigation.focus_moved_to_cancel" = "Focus déplacé vers le bouton d'annulation";
"accessibility.selection_panel.navigation.browser_selected" = "Navigateur sélectionné";
"accessibility.selection_panel.navigation.panel_dismissed" = "Panneau de sélection de navigateur fermé";

"accessibility.selection_panel.actions.select_browser" = "Sélectionner navigateur";
"accessibility.selection_panel.actions.cancel" = "Annuler sélection";
"accessibility.selection_panel.actions.dismiss" = "Fermer panneau";

"accessibility.selection_panel.announcements.panel_opened" = "Panneau de sélection de navigateur ouvert avec %d navigateurs disponibles pour %@";
"accessibility.selection_panel.announcements.browser_focused" = "Navigateur %@ mis en focus";
"accessibility.selection_panel.announcements.browser_focused_with_shortcut" = "Navigateur %@ mis en focus, raccourci %d";
"accessibility.selection_panel.announcements.browser_selected" = "Navigateur %@ sélectionné, ouverture du lien";
"accessibility.selection_panel.announcements.panel_cancelled" = "Sélection de navigateur annulée";
"accessibility.selection_panel.announcements.auto_dismiss_warning" = "Le panneau de sélection de navigateur se fermera automatiquement dans 10 secondes";

// MARK: - Onboarding
"onboarding.container.label" = "Embarquement";
"onboarding.container.hint" = "Bienvenue dans l'embarquement de Proxly. Découvrez les fonctionnalités de l'app et commencez.";

// Onboarding Pages
"onboarding.page.welcome.label" = "Page d'accueil";
"onboarding.page.welcome.hint" = "Introduction à l'application Proxly";
"onboarding.page.what_is.label" = "Page qu'est-ce que Proxly";
"onboarding.page.what_is.hint" = "Découvrez ce que fait Proxly et comment ça fonctionne";
"onboarding.page.rules.label" = "Page des règles";
"onboarding.page.rules.hint" = "Comprenez comment fonctionnent les règles dans Proxly";
"onboarding.page.menu_bar.label" = "Page de la barre de menu";
"onboarding.page.menu_bar.hint" = "Découvrez l'intégration avec la barre de menu";
"onboarding.page.focus_modes.label" = "Page des modes de concentration";
"onboarding.page.focus_modes.hint" = "Découvrez l'intégration du Mode de Concentration";
"onboarding.page.get_started.label" = "Page de démarrage";
"onboarding.page.get_started.hint" = "Terminez la configuration et commencez à utiliser Proxly";

// Onboarding Controls
"onboarding.button.previous" = "Précédent";
"onboarding.button.previous.label" = "Page précédente";
"onboarding.button.previous.hint" = "Aller à la page précédente de l'embarquement";
"onboarding.button.next" = "Suivant";
"onboarding.button.next.label" = "Page suivante";
"onboarding.button.next.hint" = "Aller à la page suivante de l'embarquement";
"onboarding.button.get_started" = "Commencer";
"onboarding.button.get_started.label" = "Commencer";
"onboarding.button.get_started.hint" = "Terminer l'embarquement et commencer à utiliser Proxly";

"onboarding.page_indicator.label" = "Indicateur de page";
"onboarding.page_indicator.value" = "Page %d sur %d";
"onboarding.page_indicator.hint" = "Position actuelle de la page dans l'embarquement";
"onboarding.page_indicators.label" = "Indicateurs de page";
"onboarding.page_indicators.value" = "Page %d sur %d";

// Symbol Accessibility
"onboarding.symbol.light.label" = "Symbole de l'application Proxly en mode clair";
"onboarding.symbol.light.hint" = "Symbole décoratif de l'application affiché en apparence claire";
"onboarding.symbol.dark.label" = "Symbole de l'application Proxly en mode sombre";
"onboarding.symbol.dark.hint" = "Symbole décoratif de l'application affiché en apparence sombre";

// Welcome Page
"onboarding.welcome.title" = "Bienvenue dans Proxly !";
"onboarding.welcome.subtitle" = "Prenez le contrôle de votre expérience de navigation web";
"onboarding.welcome.description" = "Proxly vous aide à gérer comment les liens s'ouvrent, les routant sans effort vers le bon navigateur basé sur vos règles personnalisées.";
"onboarding.welcome.app_icon.label" = "Icône de l'application Proxly";
"onboarding.welcome.app_icon.hint" = "L'icône officielle de l'app Proxly";

// What is Proxly Page
"onboarding.what_is.title" = "Que Peut Faire Proxly pour Vous ?";
"onboarding.what_is.subtitle" = "Routage intelligent de navigateur rendu simple";
"onboarding.what_is.urls.title" = "URLs";
"onboarding.what_is.browsers.title" = "Navigateurs";
"onboarding.what_is.explanation" = "Proxly ouvre automatiquement les liens dans le bon navigateur ou app, ou peut même les bloquer, tout basé sur vos règles personnalisées. Plus besoin de copier-coller les liens manuellement !";

// What is Proxly Demo Accessibility
"onboarding.what_is.urls.demo.label" = "Démonstration d'URLs d'exemple";
"onboarding.what_is.urls.demo.hint" = "Affiche des URLs de sites web d'exemple qui peuvent être routées par Proxly";
"onboarding.what_is.arrow.label" = "Flèche indiquant la direction";
"onboarding.what_is.arrow.hint" = "Montre le flux des URLs vers les navigateurs";
"onboarding.what_is.browsers.demo.label" = "Démonstration de navigateurs d'exemple";
"onboarding.what_is.browsers.demo.hint" = "Affiche des navigateurs d'exemple qui peuvent être utilisés comme cibles de routage";

// Demo Components Accessibility
"onboarding.url_demo.label" = "URL de site web d'exemple";
"onboarding.url_demo.hint" = "Démontre comment différents sites web peuvent être catégorisés pour le routage";
"onboarding.browser_demo.label" = "Option de navigateur d'exemple";
"onboarding.browser_demo.hint" = "Démontre les options de navigateur disponibles pour le routage";

// Rules Page
"onboarding.rules.title" = "Vous Avez le Contrôle avec les Règles";
"onboarding.rules.subtitle" = "Les règles sont le cœur de Proxly";
"onboarding.rules.example.work.title" = "Domaines de Travail";
"onboarding.rules.example.work.description" = "Toujours ouvrir les liens de domaine-travail.com dans Chrome";
"onboarding.rules.example.social.title" = "Réseaux Sociaux";
"onboarding.rules.example.social.description" = "Ouvrir les liens de réseaux sociaux dans votre navigateur favori";
"onboarding.rules.example.focus.title" = "Mode de Concentration";
"onboarding.rules.example.focus.description" = "Bloquer site-distrayant.com quand le Mode de Concentration Travail est actif";

// Rules Examples Accessibility
"onboarding.rules.example.work.accessibility.label" = "Exemple de règle de domaine de travail";
"onboarding.rules.example.work.accessibility.hint" = "Démontre comment router les sites web liés au travail vers des navigateurs spécifiques";
"onboarding.rules.example.social.accessibility.label" = "Exemple de règle de réseaux sociaux";
"onboarding.rules.example.social.accessibility.hint" = "Démontre comment router les sites web de réseaux sociaux vers des navigateurs préférés";
"onboarding.rules.example.focus.accessibility.label" = "Exemple de règle de mode de concentration";
"onboarding.rules.example.focus.accessibility.hint" = "Démontre comment bloquer les sites web distrayants pendant le temps de concentration";

// Menu Bar Page
"onboarding.menu_bar.title" = "Accès Rapide depuis votre Barre de Menu";
"onboarding.menu_bar.subtitle" = "Gardez un œil sur Proxly et gérez-le facilement";
"onboarding.menu_bar.proxly_icon.label" = "Icône Proxly dans la barre de menu";
"onboarding.menu_bar.proxly_icon.hint" = "L'icône Proxly dans la barre de menu de votre Mac";
"onboarding.menu_bar.feature.status.title" = "Voir si Proxly est actif";
"onboarding.menu_bar.feature.status.description" = "L'indicateur visuel montre quand les règles sont activées";
"onboarding.menu_bar.feature.toggle.title" = "Activer ou désactiver Proxly rapidement";
"onboarding.menu_bar.feature.toggle.description" = "Basculer toutes les règles activées ou désactivées d'un clic";
"onboarding.menu_bar.feature.settings.title" = "Ouvrir les paramètres de Proxly";
"onboarding.menu_bar.feature.settings.description" = "Accéder à l'éditeur de règles et à la configuration";

// Menu Bar Accessibility
"onboarding.menu_bar.wifi.label" = "Icône d'état du Wi-Fi";
"onboarding.menu_bar.battery.label" = "Icône d'état de la batterie";
"onboarding.menu_bar.mockup.label" = "Maquette de la barre de menu";
"onboarding.menu_bar.mockup.hint" = "Démonstration de comment Proxly apparaît dans la barre de menu de votre Mac";
"onboarding.menu_bar.features.label" = "Liste des fonctionnalités de la barre de menu";
"onboarding.menu_bar.features.hint" = "Liste les fonctionnalités principales disponibles depuis la barre de menu";
"onboarding.menu_bar.feature.label" = "Fonctionnalité de la barre de menu";
"onboarding.menu_bar.feature.hint" = "Fonctionnalité individuelle disponible depuis la barre de menu de Proxly";

// Focus Modes Page
"onboarding.focus_modes.title" = "Navigation Plus Intelligente avec les Modes de Concentration";
"onboarding.focus_modes.subtitle" = "Synchronisez avec vos Modes de Concentration macOS";
"onboarding.focus_modes.work.description" = "Différents navigateurs pour le temps de travail";
"onboarding.focus_modes.personal.description" = "Sites personnels pendant le temps personnel";
"onboarding.focus_modes.dnd.description" = "Bloquer les sites distrayants pendant Ne Pas Déranger";
"onboarding.focus_modes.permission_note" = "Proxly demandera la permission d'accéder aux Modes de Concentration pour activer cette fonctionnalité.";

// Focus Modes Examples Accessibility
"onboarding.focus_modes.work.accessibility.label" = "Exemple de mode de concentration travail";
"onboarding.focus_modes.work.accessibility.hint" = "Démontre comment Proxly peut router les navigateurs différemment pendant le temps de concentration travail";
"onboarding.focus_modes.personal.accessibility.label" = "Exemple de mode de concentration personnel";
"onboarding.focus_modes.personal.accessibility.hint" = "Démontre comment Proxly peut router les navigateurs différemment pendant le temps personnel";
"onboarding.focus_modes.dnd.accessibility.label" = "Exemple de mode de concentration Ne Pas Déranger";
"onboarding.focus_modes.dnd.accessibility.hint" = "Démontre comment Proxly peut bloquer les sites web distrayants pendant Ne Pas Déranger";
"onboarding.focus_modes.permission_note.label" = "Note de permission des modes de concentration";
"onboarding.focus_modes.permission_note.hint" = "Informations sur les exigences de permission pour l'intégration du Mode de Concentration";

// Get Started Page
"onboarding.get_started.title" = "Prêt à Créer votre Première Règle ?";
"onboarding.get_started.subtitle" = "La meilleure façon d'expérimenter Proxly est de configurer votre première règle";
"onboarding.get_started.step1.title" = "Définir comme Navigateur par Défaut";
"onboarding.get_started.step1.description" = "Définissez Proxly comme votre navigateur par défaut dans les Paramètres Système";
"onboarding.get_started.step2.title" = "Créer votre Première Règle";
"onboarding.get_started.step2.description" = "Ajoutez une règle pour router des domaines spécifiques vers votre navigateur préféré";
"onboarding.get_started.step3.title" = "Tester et Profiter";
"onboarding.get_started.step3.description" = "Cliquez sur n'importe quel lien et regardez Proxly le router intelligemment";
"onboarding.get_started.ready_message" = "Vous Êtes Prêt !";
"onboarding.get_started.help_message" = "Explorez les paramètres de Proxly pour le personnaliser davantage. Vous pouvez toujours ajouter, modifier ou supprimer des règles selon l'évolution de vos besoins.";

// Get Started Accessibility
"onboarding.get_started.completion.label" = "Message de fin de configuration";
"onboarding.get_started.completion.hint" = "Message de félicitations indiquant que la configuration de Proxly est terminée";
"onboarding.setup_step.button.label" = "Étape de configuration avec action";
"onboarding.setup_step.button.hint" = "Étape de configuration interactive qui peut être pressée pour effectuer une action";
"onboarding.setup_step.info.label" = "Information d'étape de configuration";
"onboarding.setup_step.info.hint" = "Étape de configuration informative qui fournit des instructions pour terminer la configuration";
// MARK: - License Sheet
"about.license_sheet.title" = "Licences Open Source";
"about.license_sheet.description" = "Cette application utilise les bibliothèques logicielles open source suivantes :";
"about.license_sheet.button.done" = "Terminé";
"about.license_sheet.swiftglass.name" = "SwiftGlass";
"about.license_sheet.swiftglass.version" = "Version : 1.9.9";
"about.license_sheet.swiftglass.source" = "Source : https://github.com/1998code/SwiftGlass/";

// MARK: - About Links
"about.link.licenses" = "Licences Open Source";
"about.link.licenses_description" = "Voir les licences des logiciels open source";

// MARK: - License Sheet Accessibility
"accessibility.about.license_sheet.title.label" = "Licences Open Source";
"accessibility.about.license_sheet.title.hint" = "Informations sur les bibliothèques tierces utilisées dans Proxly";
"accessibility.about.license_sheet.description.label" = "En-tête d'informations de licence";
"accessibility.about.license_sheet.description.hint" = "Explique quelles informations sont affichées dans cette vue";
"accessibility.about.license_sheet.done_button.label" = "Terminé";
"accessibility.about.license_sheet.done_button.hint" = "Ferme la feuille d'informations de licence";
"accessibility.about.license_sheet.swiftglass.section.label" = "Licence de la bibliothèque SwiftGlass";
"accessibility.about.license_sheet.swiftglass.section.hint" = "Informations de licence pour la bibliothèque SwiftGlass";
"accessibility.about.license_sheet.scroll_view.label" = "Licences Open Source";
"accessibility.about.license_sheet.scroll_view.hint" = "Faites défiler pour voir les informations de licence des bibliothèques tierces";

// MARK: - About Links Accessibility
"accessibility.about.links.licenses_button.label" = "Licences Open Source";
"accessibility.about.links.licenses_button.hint" = "Ouvre une feuille avec les informations de licence des logiciels open source";

// MARK: - Rule Management
"rule.remove" = "Supprimer la Règle";
"rule.drop_browser" = "Rejeter l'URL (Bloquer)";
"rule.drop_browser.description" = "Bloquer cette URL et empêcher son ouverture";
"rule.enable.title" = "Activer la Règle";
"rule.enable.subtitle" = "Lorsqu'elle est activée, cette règle sera active et utilisée pour le routage des URLs";

// MARK: - Browser Profile Selector
"browser_profile_selector.profile" = "Profil";
"browser_profile_selector.custom_arguments" = "Arguments Personnalisés";
"browser_profile_selector.no_profile_support" = "Pas de support de profil";
"browser_profile_selector.permission_needed" = "Permission requise";
"browser_profile_selector.permission_denied" = "Permission refusée";
"browser_profile_selector.permission_expired" = "Permission expirée";
"browser_profile_selector.profiles_count" = "%d profils";
"browser_profile_selector.no_profiles_found" = "Aucun profil trouvé";
"browser_profile_selector.standard_browser" = "Navigateur standard";
"browser_profile_selector.tap_to_enable_profiles" = "Appuyez pour activer les profils";
"browser_profile_selector.does_not_support_profiles" = "%@ ne prend pas en charge les profils";

// MARK: - Profile Permission View
"profile_permission.title" = "Support de Profil de Navigateur";
"profile_permission.subtitle" = "Ouvrir les liens directement dans des profils de navigateur spécifiques";
"profile_permission.what_enables" = "Ce que cela permet :";
"profile_permission.benefit.separate_browsing.title" = "Séparer la navigation professionnelle et personnelle";
"profile_permission.benefit.separate_browsing.description" = "Gardez votre navigation professionnelle et personnelle complètement séparée";
"profile_permission.benefit.different_extensions.title" = "Utiliser différentes extensions par profil";
"profile_permission.benefit.different_extensions.description" = "Chaque profil peut avoir ses propres extensions et paramètres";
"profile_permission.benefit.profile_configs.title" = "Configurations spécifiques au profil";
"profile_permission.benefit.profile_configs.description" = "Différents thèmes, signets et préférences pour chaque profil";
"profile_permission.permission_required" = "Permission requise :";
"profile_permission.requirement.read_access.title" = "Accès en lecture seule aux répertoires de navigateur";
"profile_permission.requirement.read_access.description" = "Proxly doit lire les fichiers de configuration pour détecter vos profils";
"profile_permission.requirement.no_data_access.title" = "Aucun accès aux données personnelles";
"profile_permission.requirement.no_data_access.description" = "Seuls les noms de profils et les paramètres de base sont lus - pas d'historique, de mots de passe ou de données de navigation";
"profile_permission.requirement.optional.title" = "Complètement optionnel";
"profile_permission.requirement.optional.description" = "Vous pouvez utiliser Proxly sans fonctionnalités de profil - elles sont entièrement optionnelles";
"profile_permission.browser_permissions" = "Permissions du navigateur :";
"profile_permission.learn_more" = "En savoir plus sur l'accès aux données";
"profile_permission.done" = "Terminé";
"profile_permission.state.not_requested" = "Permission non demandée";
"profile_permission.state.denied" = "Permission refusée";
"profile_permission.state.granted" = "Permission accordée";
"profile_permission.state.needs_refresh" = "Permission nécessite une actualisation";
"profile_permission.button.requesting" = "Demande en cours...";
"profile_permission.button.grant_access" = "Accorder l'Accès";
"profile_permission.button.retry" = "Réessayer";
"profile_permission.button.revoke" = "Révoquer";

// MARK: - Data Access Explanation
"data_access.title" = "Explication de l'Accès aux Données";
"data_access.what_accesses" = "Ce à quoi Proxly accède :";
"data_access.access.config_files.title" = "Fichiers de configuration de profil";
"data_access.access.config_files.description" = "Fichiers comme 'Local State' (Chrome/Edge) et 'profiles.ini' (Firefox) qui contiennent les noms de profils et paramètres de base";
"data_access.access.directory_names.title" = "Noms de répertoires de profil";
"data_access.access.directory_names.description" = "Les noms des dossiers de profil pour identifier les profils disponibles";
"data_access.never_accesses" = "Ce à quoi Proxly n'accède JAMAIS :";
"data_access.never.browsing_history.title" = "Historique de navigation";
"data_access.never.browsing_history.description" = "Votre historique de navigation n'est jamais lu ou consulté";
"data_access.never.passwords.title" = "Mots de passe et données de connexion";
"data_access.never.passwords.description" = "Aucun fichier de mot de passe ou information de connexion n'est consulté";
"data_access.never.bookmarks.title" = "Signets et données personnelles";
"data_access.never.bookmarks.description" = "Les signets personnels et les données de navigation restent privés";
"data_access.never.cookies.title" = "Cookies et données de session";
"data_access.never.cookies.description" = "Aucun cookie ou information de session n'est lu";
"data_access.technical_details" = "Détails techniques :";
"data_access.technical.security_bookmarks.title" = "Signets de sécurité délimités";
"data_access.technical.security_bookmarks.description" = "Les signets de sécurité délimités de macOS sont utilisés pour maintenir l'accès uniquement aux répertoires que vous approuvez explicitement";
"data_access.technical.read_only.title" = "Accès en lecture seule";
"data_access.technical.read_only.description" = "Proxly demande uniquement un accès en lecture - il ne peut pas modifier vos données de navigateur";
"data_access.technical.revocable.title" = "Permissions révocables";
"data_access.technical.revocable.description" = "Vous pouvez révoquer l'accès à tout moment depuis les paramètres de Proxly";

// MARK: - Profile Selection View
"profile_selection.enable_support" = "Activer le Support de Profil";
"profile_selection.grant_permission" = "Accorder la permission d'accéder aux profils %@";
"profile_selection.grant_permission_button" = "Accorder la Permission";
"profile_selection.permission_denied_title" = "Permission Refusée";
"profile_selection.permission_denied_description" = "Le support de profil nécessite la permission d'accéder aux répertoires de navigateur";
"profile_selection.retry_permission" = "Réessayer la Permission";
"profile_selection.permission_expired_title" = "Permission Expirée";
"profile_selection.permission_expired_description" = "La permission de profil doit être actualisée";
"profile_selection.refresh_permission" = "Actualiser la Permission";
"profile_selection.detecting_profiles" = "Détection des profils...";
"profile_selection.no_profiles_found" = "Aucun profil trouvé";
"profile_selection.no_profiles_description" = "Aucun profil %@ n'a été détecté. Vous pouvez créer des profils dans %@ et ils apparaîtront ici.";
"profile_selection.select_profile" = "Sélectionner un profil :";
"profile_selection.any_profile" = "N'importe quel Profil";
"profile_selection.use_default_profile" = "Utiliser le profil par défaut";
"profile_selection.default" = "Par défaut";
"profile_selection.used_time_ago" = "Utilisé %@";
"profile_selection.active" = "Actif";
"profile_selection.inactive" = "Inactif";

// MARK: - Custom Arguments View
"custom_arguments.title" = "Arguments Personnalisés";
"custom_arguments.placeholder" = "Ajouter un argument (ex. --incognito)";
"custom_arguments.add" = "Ajouter";
"custom_arguments.warning" = "Les arguments personnalisés peuvent affecter le comportement du navigateur. Utilisez avec précaution.";
"custom_arguments.help.title" = "Arguments de Navigateur Personnalisés";
"custom_arguments.help.common_arguments" = "Arguments Courants";
"custom_arguments.help.incognito.argument" = "--incognito";
"custom_arguments.help.incognito.description" = "Lancer en mode navigation privée/incognito";
"custom_arguments.help.new_window.argument" = "--new-window";
"custom_arguments.help.new_window.description" = "Ouvrir dans une nouvelle fenêtre";
"custom_arguments.help.disable_security.argument" = "--disable-web-security";
"custom_arguments.help.disable_security.description" = "Désactiver la sécurité web (développement uniquement)";
"custom_arguments.help.private_window.argument" = "--private-window";
"custom_arguments.help.private_window.description" = "Lancer en mode navigation privée";
"custom_arguments.help.new_tab.argument" = "--new-tab";
"custom_arguments.help.new_tab.description" = "Ouvrir l'URL dans un nouvel onglet";
"custom_arguments.help.important_notes" = "Notes Importantes";
"custom_arguments.help.note.behavior" = "Les arguments personnalisés peuvent affecter le comportement et la sécurité du navigateur";
"custom_arguments.help.note.browser_specific" = "Les arguments sont spécifiques au navigateur et peuvent ne pas fonctionner dans tous les navigateurs";
"custom_arguments.help.note.trust" = "N'utilisez que des arguments que vous comprenez et en lesquels vous avez confiance";
"custom_arguments.help.app_store_limitations" = "Limitations de l'App Store";
"custom_arguments.help.app_store_description" = "En raison des restrictions du bac à sable de l'App Store, certains arguments peuvent ne pas fonctionner comme prévu. Le navigateur reviendra au comportement par défaut si les arguments ne sont pas pris en charge.";
"custom_arguments.help.done" = "Terminé";
"custom_arguments.help.compatible" = "Compatible : %@";

// MARK: - Settings Profile Features
"settings.profile_features.title" = "Fonctionnalités de Profil";
"settings.profile_features.enable.title" = "Activer les Fonctionnalités de Profil";
"settings.profile_features.enable.subtitle.enabled" = "Les fonctionnalités de profil sont activées";
"settings.profile_features.enable.subtitle.disabled" = "Les fonctionnalités de profil sont désactivées";
"settings.profile_features.manage_permissions.title" = "Gérer les Permissions de Profil";
"settings.profile_features.manage_permissions.subtitle" = "Configurer quels navigateurs peuvent accéder aux données de profil";
"settings.profile_features.manage_permissions.button" = "Gérer les Permissions";

// MARK: - Browser Profile Accessibility
"accessibility.browser_profile_selector.profile.label" = "Sélection de profil";
"accessibility.browser_profile_selector.profile.hint" = "Choisir un profil de navigateur pour cette règle";
"accessibility.browser_profile_selector.custom_arguments.label" = "Arguments personnalisés";
"accessibility.browser_profile_selector.custom_arguments.hint" = "Ajouter des arguments de ligne de commande personnalisés pour le navigateur";
"accessibility.browser_profile_selector.refresh_profiles.label" = "Actualiser les profils";
"accessibility.browser_profile_selector.refresh_profiles.hint" = "Actualiser la liste des profils disponibles";

// MARK: - Profile Permission Accessibility
"accessibility.profile_permission.title.label" = "Support de Profil de Navigateur";
"accessibility.profile_permission.title.hint" = "Informations sur les fonctionnalités et permissions de profil de navigateur";
"accessibility.profile_permission.benefit.label" = "Avantage de fonctionnalité de profil";
"accessibility.profile_permission.benefit.hint" = "Explique comment les fonctionnalités de profil peuvent aider à organiser votre navigation";
"accessibility.profile_permission.requirement.label" = "Exigence de permission";
"accessibility.profile_permission.requirement.hint" = "Informations sur les permissions nécessaires et pourquoi";
"accessibility.profile_permission.browser_row.label" = "Permission de navigateur pour %@";
"accessibility.profile_permission.browser_row.hint" = "Gérer les permissions d'accès de profil pour ce navigateur";
"accessibility.profile_permission.learn_more.label" = "En savoir plus sur l'accès aux données";
"accessibility.profile_permission.learn_more.hint" = "Ouvre une explication détaillée des données auxquelles Proxly accède";

// MARK: - Profile Selection Accessibility
"accessibility.profile_selection.enable_support.label" = "Activer le support de profil";
"accessibility.profile_selection.enable_support.hint" = "Accorder la permission d'accéder aux profils de navigateur";
"accessibility.profile_selection.permission_request.label" = "Demande de permission de profil";
"accessibility.profile_selection.permission_request.hint" = "Informations sur les permissions de profil avec action pour accorder l'accès";
"accessibility.profile_selection.profile_card.label" = "Profil %@";
"accessibility.profile_selection.profile_card.hint" = "Sélectionner ce profil pour la règle";
"accessibility.profile_selection.any_profile.label" = "Option n'importe quel profil";
"accessibility.profile_selection.any_profile.hint" = "Utiliser le profil par défaut sans en spécifier un particulier";

// MARK: - Custom Arguments Accessibility
"accessibility.custom_arguments.title.label" = "Arguments personnalisés";
"accessibility.custom_arguments.title.hint" = "Ajouter des arguments de ligne de commande personnalisés pour le navigateur";
"accessibility.custom_arguments.help.label" = "Aide pour arguments personnalisés";
"accessibility.custom_arguments.help.hint" = "Ouvre les informations d'aide sur les arguments de ligne de commande du navigateur";
"accessibility.custom_arguments.argument.label" = "Argument %@";
"accessibility.custom_arguments.argument.hint" = "Appuyez pour supprimer cet argument";
"accessibility.custom_arguments.add_field.label" = "Ajouter un nouvel argument";
"accessibility.custom_arguments.add_field.hint" = "Entrer un argument de navigateur personnalisé à ajouter";
"accessibility.custom_arguments.add_button.label" = "Ajouter un argument";
"accessibility.custom_arguments.add_button.hint" = "Ajouter l'argument saisi à la liste";

// MARK: - Settings Profile Features Accessibility
"accessibility.settings.profile_features.section.label" = "Section Fonctionnalités de Profil";
"accessibility.settings.profile_features.section.hint" = "Options de configuration pour les fonctionnalités de profil de navigateur";
"accessibility.settings.profile_features.enable.label" = "Activer les fonctionnalités de profil";
"accessibility.settings.profile_features.enable.hint" = "Lorsqu'activé, permet d'ouvrir des liens dans des profils de navigateur spécifiques";
"accessibility.settings.profile_features.enable.value.enabled" = "Les fonctionnalités de profil sont activées";
"accessibility.settings.profile_features.enable.value.disabled" = "Les fonctionnalités de profil sont désactivées";
"accessibility.settings.profile_features.manage_permissions.label" = "Gérer les permissions de profil";
"accessibility.settings.profile_features.manage_permissions.hint" = "Ouvre l'interface de gestion des permissions de profil";

/* Missing Menu Bar Manager Accessibility */
"accessibility.menu_bar_manager.status_item.button_label" = "Menu Proxly";
"accessibility.menu_bar_manager.status_item.button_hint_enabled" = "Les règles Proxly sont activées. Cliquez pour ouvrir le menu.";
"accessibility.menu_bar_manager.actions.open_settings" = "Ouvrir les Paramètres";

/* Missing Settings Accessibility */
"accessibility.settings.show_tooltips.label" = "Basculer l'affichage des info-bulles";
"accessibility.settings.show_tooltips.hint" = "Basculer pour afficher ou masquer les info-bulles utiles dans l'application";
"accessibility.settings.show_tooltips.value.enabled" = "Les info-bulles sont activées";
"accessibility.settings.show_tooltips.value.disabled" = "Les info-bulles sont désactivées";

/* Missing Profile Features Settings */
"settings.section.profile_features" = "Fonctionnalités de Profil";
"accessibility.settings.profile_features.section_label" = "Section Fonctionnalités de Profil";
"settings.profile_features.enable" = "Activer les Fonctionnalités de Profil";
"settings.profile_features.subtitle.enabled" = "Les fonctionnalités de profil sont activées";
"settings.profile_features.subtitle.disabled" = "Les fonctionnalités de profil sont désactivées";
"settings.profile_features.manage_permissions" = "Gérer les Permissions de Profil";
"settings.profile_features.manage_permissions.subtitle" = "Configurer quels navigateurs peuvent accéder aux données de profil";
"settings.profile_features.manage_permissions.button" = "Gérer les Permissions";

// MARK: - License Prompt View

// MARK: - License Management
"license.status.valid" = "Licence valide";
"license.status.invalid" = "Invalide : %@";
"license.status.not_verified" = "Licence non vérifiée";
"license.status.verifying" = "Vérification de la licence...";

"license.error.empty" = "La clé de licence ne peut pas être vide";
"license.error.storage" = "Échec de l'enregistrement de la clé de licence";
"license.error.invalid_key" = "Clé de licence invalide";
"license.error.network" = "Erreur réseau lors de la vérification";
"license.error.unknown" = "Une erreur inconnue s'est produite";
"license.error.invalid_url" = "URL de vérification invalide";
"license.error.invalid_response" = "Réponse du serveur invalide";
"license.error.http_error" = "Erreur HTTP : %d";
"license.error.invalid_json" = "Format de réponse invalide";

"license.prompt.title" = "Saisir la Clé de Licence";
"license.prompt.subtitle" = "Veuillez saisir votre clé de licence Proxly pour continuer";
"license.prompt.placeholder" = "Saisissez votre clé de licence";
"license.prompt.verify_button" = "Vérifier la Licence";
"license.prompt.quit_button" = "Quitter";
"license.prompt.retry_button" = "Réessayer";

"license.onboarding.title" = "Bienvenue sur Proxly";
"license.onboarding.subtitle" = "Vérification de la Licence";
"license.onboarding.description" = "Pour utiliser Proxly, veuillez saisir votre clé de licence. Si vous n'en avez pas encore, vous pouvez en acheter une sur notre site web.";

"license.prompt.input.label" = "Clé de Licence";
"license.prompt.input.placeholder" = "Saisissez votre clé de licence";
"license.prompt.button.verify" = "Vérifier la Licence";
"license.prompt.button.purchase" = "Acheter une Licence";
"license.prompt.app_store.notice" = "Ceci est une version App Store. La vérification de licence n'est pas requise.";

"license.prompt.input.accessibility.label" = "Champ de saisie de clé de licence";
"license.prompt.input.accessibility.hint" = "Saisissez votre clé de licence Proxly ici";
"license.prompt.status.accessibility.label" = "État de vérification de licence";
"license.prompt.button.verify.accessibility.label" = "Bouton vérifier la licence";
"license.prompt.button.verify.accessibility.hint" = "Appuyez pour vérifier la clé de licence saisie";
"license.prompt.button.purchase.accessibility.label" = "Bouton acheter une licence";
"license.prompt.button.purchase.accessibility.hint" = "Appuyez pour ouvrir la page d'achat de Proxly";
"license.prompt.app_store.accessibility.label" = "Avis version App Store";

// MARK: - Onboarding License Page
"onboarding.license.title" = "Bienvenue sur Proxly";
"onboarding.license.subtitle" = "Pour commencer, veuillez vérifier votre clé de licence ou acheter Proxly.";
"onboarding.license.input.label" = "Clé de Licence";
"onboarding.license.input.placeholder" = "Saisissez votre clé de licence";
"onboarding.license.button.verify" = "Vérifier la Licence";
"onboarding.license.button.purchase" = "Acheter une Licence";
"onboarding.license.app_store.notice" = "Vous utilisez la version App Store. La vérification de licence n'est pas requise.";
"onboarding.license.help.message" = "Besoin d'aide ? Contactez le support ou vérifiez votre email d'achat pour votre clé de licence.";

"onboarding.license.input.accessibility.label" = "Champ de saisie de clé de licence";
"onboarding.license.input.accessibility.hint" = "Saisissez votre clé de licence Proxly pour continuer";
"onboarding.license.status.accessibility.label" = "État de vérification de licence";
"onboarding.license.button.verify.accessibility.label" = "Bouton vérifier la licence";
"onboarding.license.button.verify.accessibility.hint" = "Vérifier la clé de licence saisie";
"onboarding.license.button.purchase.accessibility.label" = "Bouton acheter une licence";
"onboarding.license.button.purchase.accessibility.hint" = "Ouvrir la page d'achat de Proxly";
"onboarding.license.app_store.accessibility.label" = "Avis version App Store";
"onboarding.license.help.accessibility.label" = "Informations d'aide pour la licence";

"onboarding.page.license.label" = "Page de vérification de licence";
"onboarding.page.license.hint" = "Saisissez et vérifiez votre clé de licence Proxly";

"Licensed copy" = "Copie sous licence";